Catalogs/ПодразделенияДляСтатистики.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>ПодразделенияДляСтатистики</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КодДляСтатистики</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПочтовыйАдрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодПодразделенияСтатистики</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СтруктурныеЕдиницы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТорговаяТочка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ПодразделенияДляСтатистики/Ext/ObjectModule.bsl
Процедура ВыгрузитьВ_ЗУП() Экспорт
	СтрокаПодключения = ПолныеПрава.ПолучитьСтрокуПодключения_Зуп();
	Если ОбщегоНазначения.ЭтоКопияБазы() Тогда
		СтрокаПодключения=СтрЗаменить(СтрокаПодключения,"Srvr=""srv-sql01""; Ref=""HRM""","Srvr=""srv-sql02""; Ref=""HRM_test""");
	КонецЕсли;	
	v82COMОбъект = Новый COMОбъект(ПолныеПрава.ПолучитьВерсиюКомОбъекта_Зуп() + ".COMConnector");
	
	Попытка
		v82 = v82COMОбъект.Connect(СтрокаПодключения);
		ПодключениеУстановлено=Истина;
	Исключение
		
		ПодключениеУстановлено=Ложь;
		Сообщить("Не удалось подключиться к базе зарплаты");
		Возврат;
		
	КонецПопытки;
	
	//запрос=v82.NewObject("Запрос");  
	//запрос.текст = ТекстЗапроса;
	//Запрос.УстановитьПараметр("ДатаНачала",НачалоМесяца(Период));
	ЭлементВЗУП=v82.Справочники.АК_ПодразделенияДляСтатистики.ПолучитьСсылку(V82.NewObject("УникальныйИдентификатор",Строка(ЭтотОбъект.Ссылка.УникальныйИдентификатор())));
	Об=ЭлементВЗУП.ПолучитьОбъект();
	Если Об=Неопределено Тогда
		Об=v82.Справочники.АК_ПодразделенияДляСтатистики.СоздатьЭлемент();
	КонецЕсли;
	Об.Организация=v82.Справочники.Организации.НайтиПоРеквизиту("ИНН",ЭтотОбъект.Организация.ИНН);
	Об.КодДляСтатистики=ЭтотОбъект.КодДляСтатистики;
	Об.ПочтовыйАдрес=ЭтотОбъект.ПочтовыйАдрес;
	Об.КодПодразделенияСтатистики=ЭтотОбъект.КодПодразделенияСтатистики;
	Об.Наименование=ЭтотОбъект.Наименование;
	Об.Записать();
КонецПроцедуры
